# Brewfile.apps — popular GUI apps to get a new machine productive fast.
# An opinionated, industry-common starter set — TRIM what you don't want.
# Install:  brew bundle --file=brew/Brewfile.apps

# --- Browsers ---
cask "google-chrome"
cask "firefox"
# cask "arc"                          # uncomment if you like Arc

# --- Editors & IDEs ---
cask "visual-studio-code"
cask "cursor"                         # AI-native editor
cask "claude-code"                    # terminal AI coding agent

# --- Dev: containers, API, databases ---
cask "orbstack"                       # fast Docker/Linux VMs (lighter than Docker Desktop)
cask "tableplus"                      # database GUI
cask "bruno"                          # open-source API client (Postman alternative)

# --- Launcher & window management (huge quality-of-life) ---
cask "raycast"                        # launcher / clipboard / window mgmt / scripts
cask "rectangle"                      # keyboard window snapping

# --- Productivity & notes ---
cask "1password"                      # password manager (pairs with 1password-cli)
cask "obsidian"                       # markdown knowledge base
cask "notion"

# --- Communication ---
cask "slack"
cask "zoom"
cask "discord"

# --- Design & media ---
cask "figma"
cask "vlc"
cask "spotify"

# --- Editor extensions (installed via the `code` CLI; best-effort) ---
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "ms-python.python"
vscode "ms-azuretools.vscode-docker"
vscode "pkief.material-icon-theme"
